/** 增伤区标签 */
const EnhancedDamageNotes = [
  ['2件套·元素', 15],
  ['空之杯·元素', 46.6],
  ['空之杯·物理', 58.3],
  ['勇者4·元素增伤', 12],
  ['勇者4·元素增伤(夜魂)', 28],
  ['宗室2·元素爆发', 20],
  ['魔女4·一层', 7.5],
  ['魔女4·二层', 15],
  ['魔女4·三层', 22.5],
  ['角斗4·普攻', 35],
  ['平雷·渡火·磐岩', 35],
  ['乐团4·重击', 35],
  ['追忆4·普/重/下落', 50],
  ['染血2·苍白2·物理', 25],
  ['染血4·重击', 50],
  ['逆飞4·普攻·重击', 40],
  ['苍白4·物理', 50],
  ['华馆4·岩伤', 25],
  ['水仙4·水伤', 15],
  ['回声4·岩伤', 50],
  ['剧团2·战技', 20],
  ['剧团4·战技', 70],
  ['花海4·遐思4·全伤', 50],
  ['断章4·全伤', 54],
];

export default EnhancedDamageNotes;