const updateLog = [{
    data: "2025-09-28",
    msg: ["全角色数据校准，提高了技能数值的精度。", "修复了部分角色的数据错误。"]
  },{
    data: "2025-09-22",
    msg: ["布局调整。"]
  },
  {
    data: "2025-09-10",
    msg: ["新增角色及武器数据。", "页面内鼠标样式替换成游戏内鼠标样式。"]
  },
  {
    data: "2025-09-05",
    msg: ["剧变反应计算，新增了菈乌玛、爱诺的数值提升", "月曜反应计算，新增月兆·满辉的非月兆角色加成、菲林斯加成。", "角色组队计算，新增了月兆·满辉下非月兆角色提供的加成。"]
  },
  {
    data: "2025-09-01",
    msg: ["更新了角色100级的基础数据，现在可以查看100级的伤害数据了。", "月曜反应新增了两套新圣遗物的加成。"]
  },
  {
    data: "2025-08-28",
    msg: ["修复了伊涅芙天赋攻击转精通的错误算法。", "修复了伊涅芙直伤月感电没触发六命九条爆伤加成的问题。"]
  },
  {
    data: "2025-08-22",
    msg: ["调整了部分布局。"]
  },
  {
    data: "2025-08-11",
    msg: ["修复了瓦雷莎元素爆发伤害会计算天赋加成的错误。"]
  },
  {
    data: "2025-08-01",
    msg: ["修复了部分武器数据异常不显示的bug。"]
  },
  {
    data: "2025-07-31",
    msg: ["新增角色伊涅夫、武器支离轮光、拾慧铸熔的数据。"]
  },
  {
    data: "2025-07-24",
    msg: ["新增了月感电反应的伤害计算页面。"]
  },
  {
    data: "2025-07-15",
    msg: ["修复了那维莱特元素爆发的数据错误。"]
  },
  {
    data: "2025-07-07",
    msg: ["修复了数据命名导致页面无法显示的bug。", "修复了buff的计算逻辑bug，该bug曾导致丝柯克的元素爆发无法享受到天赋的提升。"]
  },
  {
    data: "2025-07-05",
    msg: ["主角新增特训后的数据。"]
  },
  {
    data: "2025-06-18",
    msg: ["新增角色丝柯克、塔利雅、武器苍耀的数据。"]
  },
  {
    data: "2025-06-14",
    msg: ["新增队伍数据实时更新功能，切换角色的配置会实时体现在队伍数据中。"]
  },
  {
    data: "2025-06-09",
    msg: ["现在可以查看导入的圣遗物数据的词条命中次数了，本次更新之前导入的数据不支持查看，需要重新导入。自定义的圣遗物无法统计词条命中次数。"]
  },
  {
    data: "2025-06-06",
    msg: ["角色编辑页面新增了对内角色快速跳转功能。","修复了神里绫华4命减防、可莉2命减防数值错误的bug。"]
  },
  {
    data: "2025-06-04",
    msg: ["修复了海染2件套属性加成错误的bug。", "修复了爱可菲天赋没有正常降低水元素抗性的bug。", "底层代码优化，现在保存角色数据后，会自动刷新其提供的队伍增益，无需手动退队再进队。"]
  },
  {
    data: "2025-05-31",
    msg: ["修复了闲云2命效果生效对象错误的bug。", "修复了枫原万叶乱岚波止伤害类型错误的bug。","修复了武器西弗斯的月光的元素充能效果会对自身生效的bug。"]
  },
  {
    data: "2025-05-26",
    msg: ["补充了新版本新增名片图片和头像。"]
  },
  {
    data: "2025-05-17",
    msg: ["现在本工具的布局排布适配了电脑端。", "在塞索斯的普通攻击中，补充了瞑弦矢的具体伤害数值。"]
  },
  {
    data: "2025-05-13",
    msg: ["修复了无法正确导入游戏内旅行者数据的bug。", "调整了部分角色、武器的错误数据。","优化了新增圣遗物数据的流程，现在添加花和羽毛时可以自动选中主属性了。"]
  },
  {
    data: "2025-05-08",
    msg: ["新增了角色伊法、爱可菲的数据。", "新增了武器冷寂迸音、香韵奏者的数据。", "剧变反应伤害新增了伊法相关的增益配置。"],
  },
  {
    data: "2025-03-31",
    msg: ["新增了旅行者（火）命之座第六层的数据。"],
  },
  {
    data: "2025-03-26",
    msg: ["新增了角色瓦雷莎、伊安珊的数据，武器溢彩心念的数据，以及圣遗物长夜之誓、深廊终曲的数据。", "角色数据存档新增了玩家名片展示，新增了更新数据的按钮。"],
  },
  {
    data: "2025-03-19",
    msg: ["角色数据存档新增了根据玩家进行筛选的功能。（本次更新之前保存的数据不支持筛选）"],
  },
  {
    data: "2025-03-12",
    msg: ["新增游戏内数据导入功能。"], 
  },
  {
    data: "2025-03-10",
    msg: ["新增首页目录。", "修复了玛薇卡二命buff，与元素爆发buff冲突的问题。"],
  },
  {
    data: "2025-03-05",
    msg: ["修复了部分文本描述错误。", "添加圣遗物操作优化。"],
  },
  {
    data: "2025-02-14",
    msg: ["新增了梦见月瑞希的数据。"],
  },
  {
    data: "2025-01-27",
    msg: ["新增了蓝砚的数据。"],
  },
  {
    data: "2025-01-10",
    msg: ["新增了旅行者的数据。"],
  },
  {
    data: "2025-01-03",
    msg: ["修复了玛薇卡天赋无法吃到班尼特元素爆发等攻击力加成的bug。"],
  },
  {
    data: "2025-01-02",
    msg: ["新增玛薇卡、茜特菈莉及五星武器数值。"],
  },
  {
    data: "2024-12-30",
    msg: ["新增部分角色技能的治疗和护盾数值计算。"],
  },
  {
    data: "2024-12-23",
    msg: ["文案、样式调整。"],
  },
  {
    data: "2024-12-11",
    msg: ["修复命座天赋等级提升不生效的bug。"],
  },
  {
    data: "2024-12-06",
    msg: ["修复部分角色错误数据。", "调整了圣遗物词条文案。"],
  },
  {
    data: "2024-11-23",
    msg: ["新增圣遗物历史数据保存功能，现在可以更方便调整不同的圣遗物了。"],
  },
  {
    data: "2024-11-21",
    msg: ["新增5.2版本角色和武器数据。", "修复了克洛琳德伤害类型错误的bug。"],
  },
  {
    data: "2024-11-13",
    msg: ["剧变反应伤害数据已更新至5.2版本。"],
  },
  {
    data: "2024-11-01",
    msg: ["新增纳塔的四星武器【硕果钩】【弥坚骨】【镇山之钉】数据。"],
  },
  {
    data: "2024-10-26",
    msg: ["新增【云上辉星】角色伤害计算（测试版）。"],
  },
  {
    data: "2024-10-23",
    msg: ["【伤害加成便签】新增勇者4件套的效果。"],
  },
  {
    data: "2024-09-08",
    msg: ["修复了玛拉妮元素战技的【伤害提高值】快捷计算的bug。"],
  },
  {
    data: "2024-09-01",
    msg: ["新增了玛拉妮元素战技的【伤害提高值】计算。"],
  },
  {
    data: "2024-06-20",
    msg: ["修复了护盾承伤显示异常的bug。"],
  },
  {
    data: "2024-04-30",
    msg: ["新增了阿蕾奇诺死红之宴的伤害提高值的快捷计算。", "调整了数据结构，过往保存的数据会失效。"],
  },
  {
    data: "2024-04-13",
    msg: ["补充了夏沃蕾的图标，修复了神里绫人伤害提高值的计算bug。"],
  },
  {
    data: "2024-01-03",
    msg: ["新增便签弹窗的布局调整，在选择时会自动填入默认的便签名称。", "调整了【伤害提高值】的说明文本。"],
  },
  {
    data: "2023-05-02",
    msg: ["新增了白术天赋的增伤计算。"],
  },
  {
    data: "2023-02-27",
    msg: [
      "将【伤害提高值】标签化了，数据结构发生变化，过往保存的数据中涉及【伤害提高值】的计算不可用。",
      "删除了部分滑块功能。",
    ],
  },
  {
    data: "2023-02-24",
    msg: ["调整了部分样式、文本。", "新增了基础属性倍率的复合计算。"],
  },
  {
    data: "2022-12-06",
    msg: ["优化了部分样式、文本。", "新增了详细的护盾吸收量计算。"],
  },
  {
    data: "2022-12-05",
    msg: ["新增了乐园遗落之花的伤害计算。"],
  },
  {
    data: "2022-10-15",
    msg: ["在剧变反应伤害页面，新增妮露天赋的伤害提升计算。"],
  },
  {
    data: "2022-09-04",
    msg: ["新增了元素精通便签组。", "新增了超激化与蔓激化各自的的伤害提升值。", "调整了一些(?)的说明文本。"],
  },
  {
    data: "2022-09-02",
    msg: ["新增了伤害组成查看，可以看见各个伤害区间的占比。", "伤害加成标签组新增了提纳里的天赋计算。"],
  },
  {
    data: "2022-08-26",
    msg: [
      "新增草元素相关反应伤害。",
      "新增激化反应伤害计算，需要输入正确的角色等级和元素精通。",
      "算法更新。原【精通加成%】变更为【元素精通】3.0版本之前保存的数据无法重算。",
    ],
  },
  {
    data: "2022-06-21",
    msg: [
      "新增基础属性选择，可以选择生命值、防御力作为技能倍率的基础数值了。",
      "新增固定攻击力加成便签组，可以计算班尼特，九条裟罗的攻击力buff。",
      "调整了部分样式与布局，【附加伤害值】更名为【伤害值提高】。",
      "减防和无视防御区分开了，更加直观。",
    ],
  },
  {
    data: "2021-12-26",
    msg: ["调整了部分样式与布局。"],
  },
  {
    data: "2021-12-10",
    msg: [
      "调整了部分数值的上下排序，更契合在游戏内查看数值的顺序。",
      "伤害倍率%精确到小数点后两位，现在可以计算雷神开眼后的伤害提升了。",
    ],
  },
  {
    data: "2021-11-29",
    msg: [
      "【单次伤害计算】布局调整，新增额外倍率乘区，新增附加伤害计算，现在可以更便捷的计算宵宫、钟离、心海的伤害了。",
    ],
  },
  {
    data: "2021-09-25",
    msg: ["现已补充结晶盾数值，【伤害加成标签组】新增枫原万叶与绝缘之旗印的便捷计算。"],
  },
  {
    data: "2021-09-05",
    msg: ["【查看数据】现在支持重新计算数据，注意：在9月5号之前保存的数据不支持标签组重算。"],
  },
  {
    data: "2021-08-08",
    msg: ["【查看数据】现在支持删除已保存的数据。", "更新了2.0版本敌人抗性表。"],
  },
  {
    data: "2021-06-09",
    msg: ["1.6版本剧变反应伤害的基础数值更新，剧变反应公式更新，结晶盾数值暂未更新。"],
  },
  {
    data: "2021-05-06",
    msg: [
      "数据保存bug修复。该bug导致数据保存时绿字攻击力会计算两次攻击力buff加成。即在本次bug修复前，保存了有攻击力buff的数据都是不准确的。",
    ],
  },
  {
    data: "2021-03-19",
    msg: ["新增【攻击力加成%】标签组，可以快速查看讨龙英杰传、双火等攻击力加成效果，也可以自主添加标签。"],
  },
  {
    data: "2021-03-11",
    msg: ["更新了页面的字体以及部分描述。"],
  },
  {
    data: "2021-03-08",
    msg: ["新增【常见问题】页，可以查看一些计算方式和数据来源。部分使用体验优化，标签组现在自动本地缓存了。"],
  },
  {
    data: "2021-03-05",
    msg: ["新增【攻击力总计】，攻击力调整更加直观；新增了【伤害倍率便签】，让伤害倍率调整更方便快捷。"],
  },
  {
    data: "2021-03-03",
    msg: [" 单次伤害计算已完成。"],
  },
  {
    data: "2021-02-26",
    msg: [" 角色等级初始值设置为80级，元素精通初始值设置为786，增幅反应加成刚好是100整。"],
  },
];

window.updateLog = updateLog;
