<template>
  <div class="foot">
    <div class="foot-title" @click="show = true">更新日志</div>
    <van-popup
      teleport="#app"
      position="bottom"
      v-model:show="show"
      class="foot-popup"
    >
      <p>
        2021-12-26：
        <br />
        1、【伤害加成%】更名为【伤害倍率%】，并更新了相应的说明文案，可以使用负数计算了（也就是伤害降低buff）
        <br />
        2、调整了部分样式与布局
      </p>
      <p>
        2021-12-10：
        <br />
        1、调整了部分数值的上下排序，更契合在游戏内查看数值的顺序了。
        <br />
        2、防御力减少%现在可以支持添加多个，与在此版本前防御力减少的数据不兼容。
        <br />
        3、伤害倍率%精确到小数点后两位，现在可以计算雷神开眼后的伤害提升了。
      </p>
      <p>
        2021-11-29：附加伤害值现在可以支持添加多个，与改动前的附加伤害值记录不兼容。
      </p>
      <p>
        2021-11-28：【单次伤害计算】布局调整，新增额外倍率乘区，新增附加伤害计算，现在可以更便捷的计算宵宫、钟离、心海的伤害了。
      </p>
      <p>
        2021-10-23：【精通伤害】现变更为【剧变&护盾】新增护盾吸收率的转化，让护盾强效带来的效果更直观。
      </p>
      <p>
        2021-09-25：【精通伤害】现已补充结晶盾数值，【伤害倍率标签组】新增枫原万叶与绝缘之旗印的便捷计算。
      </p>
      <p>
        2021-09-05：【查看数据】现在支持重新计算数据，注意：在9月5号之前保存的数据不支持标签组重算。
      </p>
      <p>
        2021-08-08：【查看数据】现在支持删除已保存的数据；更新了2.0版本敌人抗性表；
      </p>
      <p>
        2021-06-09：1.6版本剧变反应伤害的基础数值更新，剧变反应公式更新，结晶盾数值暂未更新。
      </p>
      <p>
        2021-05-06：数据保存bug修复。该bug导致数据保存时绿字攻击力会计算两次攻击力buff加成。即在本次bug修复前，保存了有攻击力buff的数据都是不准确的。
      </p>
      <p>
        2021-03-19：新增【攻击力加成%】标签组，可以快速查看讨龙英杰传、双火等攻击力加成效果，也可以自主添加标签。
      </p>
      <p>2021-03-11：更新了页面的字体以及部分描述。</p>
      <p>
        2021-03-08：新增【常见问题】页，可以查看一些计算方式和数据来源。部分使用体验优化，标签组现在自动本地缓存了。
      </p>
      <p>
        2021-03-05:
        新增【攻击力总计】，攻击力调整更加直观；新增了【伤害倍率便签】，让伤害倍率调整更方便快捷。
      </p>
      <p>
        2021-03-03: 单次伤害计算已完成。下一步计划，部分角色特殊加成伤害计算。
      </p>
      <p>
        2021-02-26:
        角色等级初始值设置为80级，元素精通初始值设置为786，增幅反应加成刚好是100整。
      </p>
    </van-popup>
  </div>
</template>

<script>
import { Popup } from "vant";
import { defineComponent, ref } from "vue";

export default defineComponent({
  name: "foot",

  components: {
    [Popup.name]: Popup,
  },

  setup() {
    const show = ref(false);
    return { show };
  },
});
</script>

<style>
.foot {
  font-size: 14px;
}
.foot-title {
  text-align: center;
  line-height: 60px;
  margin-bottom: 30px;
}
.foot-popup {
  padding: 16px;
  box-sizing: border-box;
  height: 55%;
}
</style>